Olabode Alamu
1498663
A guide to engineering data science 
Fun-work 1

1a

In [39]:
# Data sources
# Web sources
# CSV - Comma Separated Values
# Excel
# Text files
# json files
# XML files
# binary files

1c Install missing packages

In [40]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

2a Data types in python

In [41]:
# 1 Strings
# 2 Integer
# 3 Lists
# 4 Dictionary
# 5 Tuples


2b Basic operations
Strings

In [42]:
z = 'eggs'

In [43]:
v = 'chicken'

In [44]:
z + ' ' + v # String concatenation

'eggs chicken'

In [45]:
z * 3

'eggseggseggs'

Integer

In [46]:
c = 2  # Integer type
d = 4

In [47]:
c + c  # addition

4

In [48]:
c * d  # multiplication

8

In [49]:
c / d # division

0.5

In [50]:
d - c # Substraction

2

List

In [51]:
b = ['new','clothes','are','good']  # Lists
f = ['and','watches','too']
Continent = ['Europe','America','Asia']

In [52]:
b

['new', 'clothes', 'are', 'good']

In [53]:
b * 2

['new', 'clothes', 'are', 'good', 'new', 'clothes', 'are', 'good']

In [54]:
b + f  # List concatenation

['new', 'clothes', 'are', 'good', 'and', 'watches', 'too']

 Dictionary

In [55]:
dict = {'Country':['Germany','USA','Japan'], 'Capital':['Berlin', 'Washington DC', 'Tokyo']}

In [56]:
dict

{'Capital': ['Berlin', 'Washington DC', 'Tokyo'],
 'Country': ['Germany', 'USA', 'Japan']}

In [57]:
dict['Capital']

['Berlin', 'Washington DC', 'Tokyo']

2c

In [58]:
df = DataFrame(data = dict, index = Continent ) # Pandas DataFrame object

In [59]:
df

               Capital  Country
Europe          Berlin  Germany
America  Washington DC      USA
Asia             Tokyo    Japan

In [60]:
df.to_csv('new.csv')

Import data from different files can be done with the pandas library as shown below

In [61]:
df1 = pd.read_csv('new.csv')

In [62]:
df1

  Unnamed: 0        Capital  Country
0     Europe         Berlin  Germany
1    America  Washington DC      USA
2       Asia          Tokyo    Japan

In [63]:
# Import from excel files
df2 = pd.read_excel('p.xlsx')

In [64]:
df2

                             WEEK 1 Unnamed: 1 Unnamed: 2 Unnamed: 3  \
NaN NaN NaN NaN NaN      NaN    NaN        NaN        NaN        NaN
                Name     M        T          W         TH          F
                Jacob    114     51          0          0         15
                Giselle  113     53          0          0         15
                McKenzie 130     57          0          0          5
                Ava      126     53          0          0         15
                Mekhi    130     44          0          0          5
                Brooklyn 131     40          0          0         15
                Ethan    126     53          0          0         15
                Avery    116     34          0          0         15
                Micheal  131     74          0          0         15
                Janae    100     34          0          0          5
                Akeem    100     38          0          0          5
                Laila    100     19          0          0         15

                             Unnamed: 4
NaN NaN NaN NaN NaN      NaN        NaN
                Name     M        TOTAL
                Jacob    114        180
                Giselle  113        181
                McKenzie 130        192
                Ava      126        194
                Mekhi    130        179
                Brooklyn 131        186
                Ethan    126        194
                Avery    116        165
                Micheal  131        220
                Janae    100        139
                Akeem    100        143
                Laila    100        134